{"event": "Johnson", "date_event": "2017-12-15", "id_article": 0, "num_sents": 20, "source": "001_Washington Post_1", "source_bias": "left-center", "url": "https://www.washingtonpost.com/news/post-nation/wp/2017/12/14/a-lawmaker-accused-of-molesting-a-teen-killed-himself-his-widow-calls-it-a-high-tech-lynching/", "ref": "Reuters", "ref_url": "https://www.reuters.com/article/us-kentucky-johnson/kentucky-lawmaker-a-probable-suicide-amid-sexual-misconduct-accusations-idUSKBN1E809N", "ref_title": "Kentucky lawmaker a 'probable suicide' amid sexual misconduct accusations", "ref_text": "<p>(Reuters) - Kentucky state Representative Dan Johnson, who was facing sexual assault accusations, died in a probable suicide on Wednesday, Bullitt County Coroner Dave Billings said.</p>\r\n<p>Johnson, 57, also the leader of the Louisville-area Heart of Fi", "title": "Dan Johnson suicide: Lawmaker accused of molesting teen killed himself. His widow calls it a 'high-tech lynching.'", "ann_article": 1, "ann_title": 1, "body": [{"sentence": "LOUISVILLE - Dan Johnson posted a final message on Facebook to his friends and family on Wednesday afternoon.", "sentence_index": 0, "ann": 0}, {"sentence": "It appeared to be a goodbye.", "sentence_index": 1, "ann": 1}, {"sentence": "In it, he denied the accusations that had tormented him and his family for the past 48 hours - that he, a Kentucky state representative and the self-proclaimed \"Pope\" of his Louisville church - had gotten drunk and molested a 17-year-old girl during ", "sentence_index": 2, "ann": 1}, {"sentence": "\"GOD knows the truth, nothing is the way they make it out to be,\" he wrote in the since-deleted post.", "sentence_index": 3, "ann": 1}, {"sentence": "\"I cannot handle it any longer .", "sentence_index": 4, "ann": 0}, {"sentence": "BUT HEAVEN IS MY HOME.\"", "sentence_index": 5, "ann": 0}, {"sentence": "Johnson then drove to a graffiti-covered bridge outside of Mount Washington, Ky., a quiet and isolated spot called the River Bottoms.", "sentence_index": 6, "ann": 0}, {"sentence": "He parked, got out of his car, and shot himself with a .40-caliber handgun, according to Bullitt County Sheriff Donnie Tinnell.", "sentence_index": 7, "ann": 0}, {"sentence": "The apparent suicide of a well-known local Republican here was another dark and dramatic turn in the nation's recent reckoning with sexual assault and harassment, with near-daily revelations about powerful men leading to sudden falls from positions o", "sentence_index": 8, "ann": 1}, {"sentence": "Many of those cases have led to denials, resignations, apologies; though Johnson denied the allegations, some believe they pushed him over the edge.", "sentence_index": 9, "ann": 0}, {"sentence": "Johnson's wife, Rebecca, announced Thursday that she plans to replace him in the state legislature.", "sentence_index": 10, "ann": 0}, {"sentence": "She spent the day at a funeral home arranging her husband's service, consoling her relatives and continuing to do what she does best - fighting for her family, said David Adams, a family friend and spokesman.", "sentence_index": 11, "ann": 1}, {"sentence": "\"Dan is gone but the story of his life is far from over,\" Rebecca Johnson said through Adams.", "sentence_index": 12, "ann": 0}, {"sentence": "\"These high-tech lynchings based on lies and half-truths can't be allowed to win the day.", "sentence_index": 13, "ann": 1}, {"sentence": "I've been fighting behind my husband for 30 years and his fight will go on.\"", "sentence_index": 14, "ann": 1}, {"sentence": "Johnson's death shook his family, friends, constituents and members of his church, with Kentucky's political elite immediately expressing their sadness.", "sentence_index": 15, "ann": 1}, {"sentence": "Gov.", "sentence_index": 16, "ann": 0}, {"sentence": "Matt Bevin (R) wrote on Twitter: \"My heart breaks for his family   May God indeed shed His grace on us all\" and Sen. Rand Paul (R-Ky.) said in a tweet: \"I cannot imagine his pain or the heartbreak his family is dealing with.\"", "sentence_index": 17, "ann": 1}, {"sentence": "[White House urges Roy Moore to concede, as supporters look for evidence of 'voter fraud']", "sentence_index": 18, "ann": 1}, {"sentence": "The tumult began Monday, when the Kentucky Center for Investigative Reporting published allegations that Johnson sexually assaulted his daughter's friend during a sleepover in 2013.", "sentence_index": 19, "ann": 1}]}