{"event": "Johnson", "date_event": "2017-12-15", "id_article": 1, "num_sents": 20, "source": "002_CNN_1", "source_bias": "left", "url": "http://www.cnn.com/2017/12/14/us/kentucky-state-lawmaker-death/index.html", "ref": "Reuters", "ref_url": "https://www.reuters.com/article/us-kentucky-johnson/kentucky-lawmaker-a-probable-suicide-amid-sexual-misconduct-accusations-idUSKBN1E809N", "ref_title": "Kentucky lawmaker a 'probable suicide' amid sexual misconduct accusations", "ref_text": "<p>(Reuters) - Kentucky state Representative Dan Johnson, who was facing sexual assault accusations, died in a probable suicide on Wednesday, Bullitt County Coroner Dave Billings said.</p>\r\n<p>Johnson, 57, also the leader of the Louisville-area Heart of Fi", "title": "Kentucky lawmaker Dan Johnson killed himself after sexual assault allegations", "ann_article": 1, "ann_title": 1, "body": [{"sentence": "(CNN) A Kentucky lawmaker accused of sexually assaulting a teenage girl in 2013 killed himself Wednesday, officials say, a day after he denied the allegations.", "sentence_index": 0, "ann": 0}, {"sentence": "Republican state Rep. Dan Johnson was found dead of a single gunshot wound near Mount Washington, Bullitt County Coroner Dave Billings said.", "sentence_index": 1, "ann": 1}, {"sentence": "Johnson drove onto a bridge in a rural area southeast of Louisville, parked and shot himself in front of his car, Sheriff Donnie Tinnell told CNN affiliate WDRB", "sentence_index": 2, "ann": 0}, {"sentence": "Billings ruled Johnson's death a suicide on Thursday after an autopsy, Deputy Coroner Clayton Brunson said.", "sentence_index": 3, "ann": 1}, {"sentence": "Shortly before his death, Johnson posted a rambling message on social media, denying the sexual assault allegations and urging his family to stay strong for his wife.", "sentence_index": 4, "ann": 1}, {"sentence": "Relatives became concerned after seeing the post and reached out to law enforcement, who pinged Johnson's phone and later discovered his body, according to Billings.", "sentence_index": 5, "ann": 0}, {"sentence": "Billings said he was called to the scene around 7:30 p.m.", "sentence_index": 6, "ann": 0}, {"sentence": "Authorities discovered Johnson's body in front of his truck and a 40-caliber semi-automatic handgun nearby, he said.", "sentence_index": 7, "ann": 1}, {"sentence": "CNN has reached out to the Bullitt County Sheriff's Office and the Kentucky governor's office but has not heard back.", "sentence_index": 8, "ann": 1}, {"sentence": "His accuser said the alleged sexual assault took place in the early hours of New Year's Day in 2013 when she was 17, according to the center's explosive investigative report published Monday.", "sentence_index": 9, "ann": 0}, {"sentence": "The accuser, identified as Maranda Richmond, is now 21.", "sentence_index": 10, "ann": 0}, {"sentence": "She said she was staying in a living area of Louisville's Heart of Fire Church, where Johnson was pastor, when he drunkenly kissed and fondled her underneath her clothes, according to the investigative report.", "sentence_index": 11, "ann": 1}, {"sentence": "The center got its hands on police documents about the accusations and interviewed Richmond, leading to its story on how Johnson allegedly forced himself on her when she was a teenager.", "sentence_index": 12, "ann": 1}, {"sentence": "Johnson denied the allegations, a day after the center published its report, saying Richmond was motivated by his political opponents.", "sentence_index": 13, "ann": 1}, {"sentence": "\"This allegation concerning this young girl absolutely has no merit,\" he said.", "sentence_index": 14, "ann": 1}, {"sentence": "\"As a matter of fact, some of this I heard yesterday for the first time as I read the story.\"", "sentence_index": 15, "ann": 0}, {"sentence": "The same day Johnson held a news conference, Louisville detectives reopened the investigation, according to the Kentucky Center for Investigative Reporting.", "sentence_index": 16, "ann": 1}, {"sentence": "Johnson posted a message on his Facebook page Wednesday evening, saying the accusations \"are false\" and \"only God knows the truth.\"", "sentence_index": 17, "ann": 0}, {"sentence": "The post appears to have been deleted.", "sentence_index": 18, "ann": 1}, {"sentence": "\"GOD and only GOD knows the truth, nothing is the way they make it out to be.", "sentence_index": 19, "ann": 0}]}