{"event": "Facebook", "date_event": "2018-03-18", "id_article": 15, "num_sents": 20, "source": "022_RTE", "source_bias": "least", "url": "https://www.rte.ie/news/2018/0318/948342-facebook/", "ref": "016_Reuters_1", "ref_url": "https://www.reuters.com/article/us-facebook-cambridge-analytica-regulati/facebook-critics-want-regulation-investigation-after-data-misuse-idUSKCN1GU01A", "ref_title": "Facebook critics want regulation, investigation after data misuse", "ref_text": "<p>SAN FRANCISCO (Reuters) - Facebook Inc faced new calls for regulation from within U.S. Congress and was hit with questions about personal data safeguards on Saturday after reports a political consultant gained inappropriate access to 50 million users' ", "title": "Facebook faces new calls for regulation", "ann_article": 1, "ann_title": 0, "body": [{"sentence": "Facebook faces new calls for regulation from within US Congress and was hit with questions about personal data safeguards after reports that a political consultant gained inappropriate access to 50 million users' data starting in 2014.", "sentence_index": 0, "ann": 0}, {"sentence": "Facebook disclosed the issue in a blog post on Friday, hours before media reports that conservative-leaning Cambridge Analytica, a data company known for its work on Donald Trump's 2016 presidential campaign, was given access to the data and may not ", "sentence_index": 1, "ann": 0}, {"sentence": "The scrutiny presented a new threat to Facebook's reputation, which was already under attack over Russia's alleged use of Facebook tools to sway American voters before and after the 2016 US elections.", "sentence_index": 2, "ann": 0}, {"sentence": "\"It's clear these platforms can't police themselves,\" Democratic US Senator Amy Klobuchar tweeted.", "sentence_index": 3, "ann": 0}, {"sentence": "\"They say 'trust us.'", "sentence_index": 4, "ann": 0}, {"sentence": "Mark Zuckerberg needs to testify before Senate Judiciary,\" she added, referring to Facebook's CEO and a committee she sits on.", "sentence_index": 5, "ann": 0}, {"sentence": "Facebook said the root of the problem was that researchers and Cambridge Analytica lied to it and abused its policies, but critics have thrown the blame at Facebook as well, demanding answers on behalf of users and calling for new regulation.", "sentence_index": 6, "ann": 0}, {"sentence": "Facebook insisted the data was misused but not stolen, because users gave permission, sparking a debate about what constitutes a hack that must be disclosed to customers.", "sentence_index": 7, "ann": 0}, {"sentence": "\"The lid is being opened on the black box of Facebook's data practices, and the picture is not pretty,\" said Frank Pasquale, a University of Maryland law professor who has written about Silicon Valley's use of data.", "sentence_index": 8, "ann": 0}, {"sentence": "Pasquale said Facebook's response that data had not technically been stolen seemed to obfuscate the central issue that data was apparently used in a way contrary to the expectations of users.", "sentence_index": 9, "ann": 0}, {"sentence": "Democratic US Senator Mark Warner said the episode bolstered the need for new regulations about internet advertising, describing the industry as the \"Wild West.\"", "sentence_index": 10, "ann": 0}, {"sentence": "\"Whether it's allowing Russians to purchase political ads, or extensive micro-targeting based on ill-gotten user data, it's clear that, left unregulated, this market will continue to be prone to deception and lacking in transparency,\" he said.", "sentence_index": 11, "ann": 0}, {"sentence": "With Republicans controlling the Senate's majority, though, it was not clear if Klobuchar and Warner would prevail.", "sentence_index": 12, "ann": 0}, {"sentence": "The New York Times and London's Observer reported that private information from more than 50 million Facebook users improperly ended up in the hands of Cambridge Analytica, and the information has not been deleted despite Facebook's demands beginnin", "sentence_index": 13, "ann": 1}, {"sentence": "Some 270,000 people allowed use of their data by a researcher, who scraped the data of all their friends as well, a move allowed by Facebook until 2015.", "sentence_index": 14, "ann": 0}, {"sentence": "The researcher sold the data to Cambridge, which was against Facebook rules, the newspapers said.", "sentence_index": 15, "ann": 0}, {"sentence": "Cambridge Analytica worked on Trump's 2016 campaign.", "sentence_index": 16, "ann": 0}, {"sentence": "A Trump campaign official said, though, that it used Republican data sources, not Cambridge Analytica, for its voter information.", "sentence_index": 17, "ann": 0}, {"sentence": "Facebook, in a series of written statements, said its policies had been broken by Cambridge Analytica and researchers and that it was exploring legal action.", "sentence_index": 18, "ann": 0}, {"sentence": "Cambridge Analytica in turn said it had deleted all the data and that the company supplying it had been responsible for obtaining it.", "sentence_index": 19, "ann": 0}]}