{"event": "Facebook", "date_event": "2018-03-18", "id_article": 17, "num_sents": 18, "source": "037_Boston Herald_1", "source_bias": "right-center", "url": "http://www.bostonherald.com/business/business_markets/2018/03/maura_healey_to_probe_brit_data_firm", "ref": "016_Reuters_1", "ref_url": "https://www.reuters.com/article/us-facebook-cambridge-analytica-regulati/facebook-critics-want-regulation-investigation-after-data-misuse-idUSKCN1GU01A", "ref_title": "Facebook critics want regulation, investigation after data misuse", "ref_text": "<p>SAN FRANCISCO (Reuters) - Facebook Inc faced new calls for regulation from within U.S. Congress and was hit with questions about personal data safeguards on Saturday after reports a political consultant gained inappropriate access to 50 million users' ", "title": "Maura Healey to probe Brit data firm", "ann_article": 0, "ann_title": 0, "body": [{"sentence": "Massachusetts Attorney General Maura Healey is launching a probe into British-based Cambridge Analytica, a data-analysis firm that worked for President Trump's 2016 campaign, over allegations that it held onto improperly obtained user data after tell", "sentence_index": 0, "ann": 0}, {"sentence": "\"Massachusetts residents deserve answers immediately from Facebook and Cambridge Analytica,\" Healey said in a post on Twitter yesterday.", "sentence_index": 1, "ann": 0}, {"sentence": "\"We are launching an investigation.\"", "sentence_index": 2, "ann": 0}, {"sentence": "Healey's office has already reached out to Facebook to determine what data was accessed, how it was used, and whether Bay State residents were impacted.", "sentence_index": 3, "ann": 0}, {"sentence": "Healey's announcement came hours after the social network issued a blog post explaining its decision to suspended the firm.", "sentence_index": 4, "ann": 0}, {"sentence": "Years ago, Facebook said, Cambridge Analytica received user data from a Facebook app that purported to be a psychological research tool, though the firm wasn't authorized to have that information.", "sentence_index": 5, "ann": 0}, {"sentence": "About 270,000 people downloaded the app and shared their personal details with it, Facebook said.", "sentence_index": 6, "ann": 0}, {"sentence": "Cambridge Analytica later certified in 2015 that it had destroyed the information that it received, according to Facebook, although the social network said it received reports \"several days ago\" that not all of the data was deleted.", "sentence_index": 7, "ann": 0}, {"sentence": "While it investigates the matter, Facebook has also suspended the access of Cambridge Analytica's parent company, Strategic Communication Laboratories; the academic who created the app in question, a University of Cambridge psychology professor named", "sentence_index": 8, "ann": 0}, {"sentence": "Exactly why the handling of this data warranted both suspension and Facebook's unusual public explanation of the move wasn't clear.", "sentence_index": 9, "ann": 0}, {"sentence": "The blog post, written by Facebook deputy general counsel Paul Grewal, cited the \"public prominence\" of Cambridge Analytica, called the alleged data retention an \"unacceptable violation of trust\" and said the social network will take legal action if", "sentence_index": 10, "ann": 0}, {"sentence": "In a statement, a Cambridge Analytica spokesman denied any wrongdoing.", "sentence_index": 11, "ann": 1}, {"sentence": "He said the parent company's SCL Elections unit hired Kogan to undertake \"a large-scale research project in the U.S.,\" but later learned that he had obtained data in violation of Facebook policies, and subsequently deleted all data it received from ", "sentence_index": 12, "ann": 1}, {"sentence": "For the \"avoidance of doubt,\" the spokesman said, none of Kogan's data was used in Cambridge Analytica's 2016 election work.", "sentence_index": 13, "ann": 0}, {"sentence": "Kogan did not immediately reply to an emailed request for comment.", "sentence_index": 14, "ann": 0}, {"sentence": "Wylie could not immediately be located.", "sentence_index": 15, "ann": 0}, {"sentence": "Cambridge Analytica CEO Alexander Nix also disclosed in November that the company reached out to WikiLeaks founder Julian Assange during the campaign to request emails related to the Hillary Clinton campaign.", "sentence_index": 16, "ann": 0}, {"sentence": "Nix said Assange said no.", "sentence_index": 17, "ann": 0}]}