{"event": "Facebook", "date_event": "2018-03-18", "id_article": 18, "num_sents": 20, "source": "048_Breitbart News_1", "source_bias": "right-extream", "url": "http://www.breitbart.com/tech/2018/03/17/facebook-establishment-media-spar-data-obtained-cambridge-analytica/", "ref": "016_Reuters_1", "ref_url": "https://www.reuters.com/article/us-facebook-cambridge-analytica-regulati/facebook-critics-want-regulation-investigation-after-data-misuse-idUSKCN1GU01A", "ref_title": "Facebook critics want regulation, investigation after data misuse", "ref_text": "<p>SAN FRANCISCO (Reuters) - Facebook Inc faced new calls for regulation from within U.S. Congress and was hit with questions about personal data safeguards on Saturday after reports a political consultant gained inappropriate access to 50 million users' ", "title": "Facebook, Establishment Media Spar over Data Obtained by Cambridge Analytica", "ann_article": 0, "ann_title": 0, "body": [{"sentence": "Facebook recently banned Strategic Communication Laboratories, the parent company of Cambridge Analytica, from using their platform.", "sentence_index": 0, "ann": 0}, {"sentence": "According to Facebook, the data analytics firm - which played a key role in the Trump and Brexit campaigns - improperly obtained user data from University of Cambridge psychologist Aleksandr Kogan.", "sentence_index": 1, "ann": 0}, {"sentence": "Although Kogan obtained the data from Facebook in accordance with their policies, the social media company claims that he then passed the data to Cambridge Analytica, and to Christopher Wylie, an employee of Eunoia Technologies.", "sentence_index": 2, "ann": 0}, {"sentence": "Kogan and Wylie have also been banned from Facebook.", "sentence_index": 3, "ann": 1}, {"sentence": "Facebook conceded that Kogan \"gained access to this information in a legitimate way and through the proper channels that governed all developers on Facebook at that time,\" but said that by passing the data to third parties \"he did not subsequently ab", "sentence_index": 4, "ann": 0}, {"sentence": "Nevertheless, The Observer, a British newspaper owned by the left-leaning Guardian Media Group, claimed that Cambridge Analytica's use of the data constituted \"one of the tech giant's biggest ever data breaches.\"", "sentence_index": 5, "ann": 0}, {"sentence": "The New York Times also framed the incident as a \"breach\" and a \"data leak.\"", "sentence_index": 6, "ann": 0}, {"sentence": "Facebook strongly disputes this version of events.", "sentence_index": 7, "ann": 0}, {"sentence": "According to The Observer, the social media giant's lawyers warned the newspaper that their claims were \"false and defamatory,\" and reserved their legal position.", "sentence_index": 8, "ann": 0}, {"sentence": "The New York Times and Observer stories are based on the testimony of Christopher Wylie, a former Cambridge Analytica employee who left the company in 2014 - two years before the 2016 election.", "sentence_index": 9, "ann": 0}, {"sentence": "When asked if his use of Facebook data constituted a \"hack,\" Wylie told The Observer that he assumed that it was all \"entirely legal and above board.\"", "sentence_index": 10, "ann": 0}, {"sentence": "Cambridge Analytica CEO Alexander Nix was previously questioned by British politicians on his company's role in Brexit at the Trump campaign.", "sentence_index": 11, "ann": 0}, {"sentence": "Nix has said that his company uses \"data and technology to engage with voters in a more informed and relevant way.", "sentence_index": 12, "ann": 1}, {"sentence": "That can only be good for politics and democracy.\"", "sentence_index": 13, "ann": 0}, {"sentence": "The company is partially owned by the family of hedge fund manager Robert Mercer.", "sentence_index": 14, "ann": 0}, {"sentence": "Former Breitbart News executive director Stephen K. Bannon previously worked as vice president of Cambridge Analytica's board.", "sentence_index": 15, "ann": 0}, {"sentence": "The company worked for the presidential campaigns of both Sen. Ted Cruz and Donald Trump.", "sentence_index": 16, "ann": 0}, {"sentence": "In a statement, Cambridge Analytica denied that they had knowingly breached Facebook's terms of service.", "sentence_index": 17, "ann": 0}, {"sentence": "\"Cambridge Analytica fully complies with Facebook's terms of service and is currently in touch with Facebook following its recent statement that it had suspended the company from its platform, in order to resolve this matter as quickly as possible\" ", "sentence_index": 18, "ann": 0}, {"sentence": "\"Cambridge Analytica's Commercial and Political divisions use social media platforms for outward marketing, delivering data-led and creative content to targeted audiences.", "sentence_index": 19, "ann": 0}]}