{"event": "Facebook", "date_event": "2018-03-18", "id_article": 22, "num_sents": 19, "source": "103_PJ Media_1", "source_bias": "right", "url": "https://pjmedia.com/lifestyle/facebook-fails-again/", "ref": "016_Reuters_1", "ref_url": "https://www.reuters.com/article/us-facebook-cambridge-analytica-regulati/facebook-critics-want-regulation-investigation-after-data-misuse-idUSKCN1GU01A", "ref_title": "Facebook critics want regulation, investigation after data misuse", "ref_text": "<p>SAN FRANCISCO (Reuters) - Facebook Inc faced new calls for regulation from within U.S. Congress and was hit with questions about personal data safeguards on Saturday after reports a political consultant gained inappropriate access to 50 million users' ", "title": "Facebook Suspends Trump Data Firm for Harvesting Private Information of Users", "ann_article": 1, "ann_title": 1, "body": [{"sentence": "We've been promised by Google, Facebook, and other social sites that our personal information is protected and that when some of our information is provided to third parties, our identity will never be made known.", "sentence_index": 0, "ann": 1}, {"sentence": "But now we have an example of just how disingenuous those promises are.", "sentence_index": 1, "ann": 1}, {"sentence": "Facebook has just suspended Strategic Communication Laboratories (SCL) and Cambridge Analytica for violating its privacy policies.", "sentence_index": 2, "ann": 0}, {"sentence": "These companies worked with President Trump's 2016 campaign, using Facebook and other social media to target ads at voters much more effectively than the Clinton campaign.", "sentence_index": 3, "ann": 1}, {"sentence": "Cambridge Analytica, which is owned by hedge fund billionaire Robert Mercer, has been using Facebook as a tool to build psychological profiles that represent some 230 million adult Americans and is being accused by Facebook of revealing the private i", "sentence_index": 4, "ann": 1}, {"sentence": "While these companies utilized the tools that Facebook created for their advertisers to do much the same targeting, they are accused of going further and violating Facebook's terms of service.", "sentence_index": 5, "ann": 1}, {"sentence": "Facebook Deputy General Counsel Paul Grewal explained that SCL worked with Aleksandr Kogan, a psychology professor at the University of Cambridge, who developed \"Thisisyourdigitallife,\" an app that enticed Facebook users to reveal more about their pe", "sentence_index": 6, "ann": 1}, {"sentence": "According to the New York Times, questions like these were asked: \"Do you panic easily?", "sentence_index": 7, "ann": 1}, {"sentence": "Do you often feel blue?", "sentence_index": 8, "ann": 0}, {"sentence": "Do you have a sharp tongue?", "sentence_index": 9, "ann": 0}, {"sentence": "Do you get chores done right away?", "sentence_index": 10, "ann": 0}, {"sentence": "Do you believe in the importance of art?\"", "sentence_index": 11, "ann": 0}, {"sentence": "\"If ever you've answered questions like these on one of the free personality quizzes floating around Facebook, you'll have learned what's known as your Ocean score: How you rate according to the big five psychological traits of Openness, Conscientio", "sentence_index": 12, "ann": 1}, {"sentence": "More than a quarter of a million Facebook users downloaded the app and logged in through Facebook, which gave Kogan personal information, including where they lived, their likes and dislikes, and information about their friends.", "sentence_index": 13, "ann": 1}, {"sentence": "Kogan, in turn, provided the personal information to a data harvesting company, Eunoia Technologies, in violation of Facebook rules that forbid app developers from sharing users' personal information.", "sentence_index": 14, "ann": 1}, {"sentence": "This data was then shared with SCL/Cambridge Analytica to target Facebook users during the election campaign.", "sentence_index": 15, "ann": 1}, {"sentence": "When Facebook discovered the violation of their policy, they asked Kogan to verify that the personal data he collected was destroyed and simply took him at his word that it was.", "sentence_index": 16, "ann": 1}, {"sentence": "Facebook just learned that, in fact, the data was not deleted as requested, and so they suspended SCL/Cambridge Analytica, Wylie, an intermediary, and Kogan from Facebook, pending further investigation.", "sentence_index": 17, "ann": 1}, {"sentence": "Cambridge Analytica released a statement claiming that it deleted all of its data after learning that Global Science Research did not comply with Facebook's terms of service and that it is working with the social media company to \"resolve this matte", "sentence_index": 18, "ann": 1}]}