{"event": "NFL", "date_event": "2017-09-24", "id_article": 27, "num_sents": 20, "source": "034_Washington Examiner_1", "source_bias": "right", "url": "http://www.washingtonexaminer.com/trump-performs-pick-and-roil-on-world-of-sports/article/2635401", "ref": "022_Voice of America_1", "ref_url": "https://www.voanews.com/usa/trump-clashes-sports-world-over-player-protests", "ref_title": "Trump Clashes With Sports World Over Player Protests", "ref_text": "<p>President Donald Trump and the sports world engaged in an intensifying spat on Saturday after he called for National Football League owners to fire players who protest during the U.S. national anthem and disinvited a National Basketball Association sta", "title": "Trump performs pick and roil on world of sports", "ann_article": 0, "ann_title": 1, "body": [{"sentence": "Addressing an exuberant crowd in an arena Friday evening, President Trump roiled the world of sports at an event which originally had nothing to do with sports.", "sentence_index": 0, "ann": 0}, {"sentence": "The rally, meant to gin up support for Sen. Luther Strange, who on Tuesday faces an uphill battle in a GOP runoff contest, took a hard turn to politics when Trump exhorted NFL team owners to fire players who kneel during the national anthem.", "sentence_index": 1, "ann": 0}, {"sentence": "\"Wouldn't you love to see one of these NFL owners, when somebody disrespects our flag, to say, 'Get that son of a bitch off the field right now.", "sentence_index": 2, "ann": 1}, {"sentence": "He is fired.", "sentence_index": 3, "ann": 0}, {"sentence": "He's fired,'\" Trump declared.", "sentence_index": 4, "ann": 0}, {"sentence": "Hours later Trump was back on offense, tweeting about NBA star Stephen Curry, who a day prior told reporters that he really didn't want to go to the White House if his championship-winning team, the Golden State Warriors, attended a customary White H", "sentence_index": 5, "ann": 0}, {"sentence": "\"Going to the White House is considered a great honor for a championship team,\" Trump declared in a tweet Saturday morning.", "sentence_index": 6, "ann": 0}, {"sentence": "\"Stephen Curry is hesitating,therefore invitation is withdrawn!\"", "sentence_index": 7, "ann": 0}, {"sentence": "The backlash has been fierce and widespread, including retorts from an array of players, politicians and civil rights groups.", "sentence_index": 8, "ann": 0}, {"sentence": "NFL Commissioner Roger Goodell rebuked Trump over what he panned as \"divisive\" comments while celebrating some players' recent efforts to raise a significant amount of money for people impacted by hurricanes that have wracked the Southeast U.S.", "sentence_index": 9, "ann": 0}, {"sentence": "Trump has since fired back at Goodell, tweeting that the commissioner was tring to \"justify\" the \"total disrespect certain players show to our country\" -- players, Trump noted, who have the \"privilege\" to make millions of dollars.", "sentence_index": 10, "ann": 0}, {"sentence": "\"Tell them to stand!\"", "sentence_index": 11, "ann": 0}, {"sentence": "Trump demanded.", "sentence_index": 12, "ann": 0}, {"sentence": "The NFL Players Association declared that \"it will never back down\" in supporting players' rights.", "sentence_index": 13, "ann": 0}, {"sentence": "\"Whether or not Roger and the owners will speak for themselves about their views on player rights and their commitment to player safety remains to be seen,\" NFLPA executive director DeMaurice Smith said in a statement posted to Twitter Saturday morn", "sentence_index": 14, "ann": 0}, {"sentence": "\"This union, however, will never back down when it comes to protecting the constitutional rights of our players as citizens as well as their safety as men who compete in a game that exposes them to great risks.\"", "sentence_index": 15, "ann": 0}, {"sentence": "While a number of players also slammed the president for his attack on the NFL, including Redskins linebacker Zach Brown, who tweeted at Trump to \"stay in [your] place,\" the Trump faithful rallied to his cause.", "sentence_index": 16, "ann": 0}, {"sentence": "For example, Fox News' Sean Hannity tweeted Saturday of the coming demise for the NFL if it and its players keep dabbling in politics.", "sentence_index": 17, "ann": 0}, {"sentence": "\"If @NFL and players choose to continue to make political statements (their right) I predict fans who disagree will flee (their right also),\" he said.", "sentence_index": 18, "ann": 0}, {"sentence": "Former San Francisco 49ers quarterback Colin Kaepernick sparked the kneeling controversy last season when he took a knee during the national anthem to protest the treatment of African Americans and other minorities in the U.S.", "sentence_index": 19, "ann": 0}]}