{"event": "NFL", "date_event": "2017-09-24", "id_article": 30, "num_sents": 20, "source": "066_Dallas News_1", "source_bias": "right-center", "url": "https://sportsday.dallasnews.com/dallas-cowboys/cowboys/2017/09/23/jason-garrett-expect-cowboys-protest-national-anthem-president-trumps-comments", "ref": "022_Voice of America_1", "ref_url": "https://www.voanews.com/usa/trump-clashes-sports-world-over-player-protests", "ref_title": "Trump Clashes With Sports World Over Player Protests", "ref_text": "<p>President Donald Trump and the sports world engaged in an intensifying spat on Saturday after he called for National Football League owners to fire players who protest during the U.S. national anthem and disinvited a National Basketball Association sta", "title": "Dallas Cowboys: Jason Garrett doesn't expect Cowboys to protest national anthem following President Trump's comments", "ann_article": 1, "ann_title": 0, "body": [{"sentence": "Dallas Cowboys head coach Jason Garrett at the podium during his press conference a day after the Cowboys released Dallas Cowboys wide receiver Lucky Whitehead (13) at training camp in Oxnard, California on Tuesday, July 25, 2017.", "sentence_index": 0, "ann": 0}, {"sentence": "(Vernon Bryant/The Dallas Morning News)", "sentence_index": 1, "ann": 0}, {"sentence": "FRISCO -- Jason Garrett doesn't expect Cowboys players to protest the national anthem Monday night after hearing President Trump's recent criticism of those who have protested before NFL games.", "sentence_index": 2, "ann": 0}, {"sentence": "The Cowboys coach had very little to say when asked during a Saturday news conference about Trump's comments Friday night.", "sentence_index": 3, "ann": 0}, {"sentence": "Garrett replied \"I don't\" when asked if there's a need to address Trump's words with the team.", "sentence_index": 4, "ann": 0}, {"sentence": "\"We have an approach that we believe in,\" Garrett said.", "sentence_index": 5, "ann": 0}, {"sentence": "\"I have no real comment beyond that.\"", "sentence_index": 6, "ann": 0}, {"sentence": "Does Garrett not have an opinion on what Trump said?", "sentence_index": 7, "ann": 0}, {"sentence": "\"I just don't think it's in anyone's best interest for me to comment on that,\" he responded.", "sentence_index": 8, "ann": 0}, {"sentence": "During a rally in Alabama, Trump encouraged fans to boycott games in which they see players protesting.", "sentence_index": 9, "ann": 0}, {"sentence": "\"Wouldn't you love to see one of these NFL owners, when somebody disrespects our flag, to say, 'Get that son of a bitch off the field right now, out, he's fired.", "sentence_index": 10, "ann": 0}, {"sentence": "He's fired,'\" Trump said.", "sentence_index": 11, "ann": 0}, {"sentence": "\"You know, some owner is going to do that.", "sentence_index": 12, "ann": 0}, {"sentence": "He's going to say, 'That guy that disrespects our flag, he's fired.'", "sentence_index": 13, "ann": 0}, {"sentence": "And that owner, they don't know it, they're friends of mine, many of them, [but] they'll be the most popular person in this country.\"", "sentence_index": 14, "ann": 0}, {"sentence": "Cowboys linebackers Sean Lee and Jaylon Smith were asked Saturday for their thoughts on hearing those words from the President.", "sentence_index": 15, "ann": 0}, {"sentence": "\"I don't agree with his comments,\" Smith said.", "sentence_index": 16, "ann": 0}, {"sentence": "\"But I love my team.", "sentence_index": 17, "ann": 0}, {"sentence": "Really no other comment than that.", "sentence_index": 18, "ann": 0}, {"sentence": "I don't agree with it.\"", "sentence_index": 19, "ann": 0}]}