{"event": "NFL", "date_event": "2017-09-24", "id_article": 31, "num_sents": 11, "source": "076_Breitbart News_1", "source_bias": "right-extream", "url": "http://www.breitbart.com/sports/2017/09/23/president-donald-trump-slams-commish-goodell-justifying-nfls-disrespect-country/", "ref": "022_Voice of America_1", "ref_url": "https://www.voanews.com/usa/trump-clashes-sports-world-over-player-protests", "ref_title": "Trump Clashes With Sports World Over Player Protests", "ref_text": "<p>President Donald Trump and the sports world engaged in an intensifying spat on Saturday after he called for National Football League owners to fire players who protest during the U.S. national anthem and disinvited a National Basketball Association sta", "title": "President Donald Trump Slams Commish Goodell for 'Justifying' the NFL's 'Disrespect' for Our Country", "ann_article": 1, "ann_title": 0, "body": [{"sentence": "On Saturday evening, Trump sent out a tweet urging the commissioner to \"tell them to stand!\"", "sentence_index": 0, "ann": 0}, {"sentence": "\"Roger Goodell of NFL just put out a statement trying to justify the total disrespect certain players show to our country,\" Trump tweeted on September 23.", "sentence_index": 1, "ann": 0}, {"sentence": "\"Tell them to stand!\"", "sentence_index": 2, "ann": 0}, {"sentence": "he added.", "sentence_index": 3, "ann": 0}, {"sentence": "Trump's early evening tweet came several hours after a statement by the NFL chief who called the president \"divisive\" and said he failed to \"understand the overwhelming force for good\" the NFL offers the country.", "sentence_index": 4, "ann": 0}, {"sentence": "The NFL commish also touted his league as fostering \"unity\" despite the disunity that the protests he has allowed has caused the nation.", "sentence_index": 5, "ann": 1}, {"sentence": "On Saturday morning, Goodell said, \"The NFL and our players are at our best when we help create a sense of unity in our country and our culture.", "sentence_index": 6, "ann": 0}, {"sentence": "There is no better example than the amazing response from our clubs and players to the terrible natural disasters we've experienced over the last month.", "sentence_index": 7, "ann": 0}, {"sentence": "Divisive comments like these demonstrate an unfortunate lack of respect for the NFL, our great game and all of our players, and a failure to understand the overwhelming force for good our clubs and players represent in our communities.\"", "sentence_index": 8, "ann": 1}, {"sentence": "Goodell's statement came the morning after Trump's broadside against the NFL delivered during a Friday evening rally in Huntsville, Alabama, for Republican Senate candidate Luther Strange.", "sentence_index": 9, "ann": 0}, {"sentence": "During the September 22 rally, Trump called players who protest during the playing of the national anthem \"sons of b**ches\" and said he hoped NFL owners would \"fire\" them.", "sentence_index": 10, "ann": 0}]}