{"event": "NFL", "date_event": "2017-09-24", "id_article": 32, "num_sents": 9, "source": "092_New York Post_1", "source_bias": "right-center", "url": "http://nypost.com/2017/09/23/trump-doubles-down-on-call-to-fire-nfl-anthem-protesters/", "ref": "022_Voice of America_1", "ref_url": "https://www.voanews.com/usa/trump-clashes-sports-world-over-player-protests", "ref_title": "Trump Clashes With Sports World Over Player Protests", "ref_text": "<p>President Donald Trump and the sports world engaged in an intensifying spat on Saturday after he called for National Football League owners to fire players who protest during the U.S. national anthem and disinvited a National Basketball Association sta", "title": "Trump doubles down on call to 'fire' NFL anthem protesters", "ann_article": 0, "ann_title": 0, "body": [{"sentence": "President Trump ratcheted up his war of words with the NFL Saturday, insisting again that the league should boot players who refuse to stand during the national anthem.", "sentence_index": 0, "ann": 0}, {"sentence": "\"If a player wants the privilege of making millions of dollars in the NFL,or other leagues, he or she should not be allowed to disrespect .our Great American Flag (or Country) and should stand for the National Anthem.", "sentence_index": 1, "ann": 0}, {"sentence": "If not, YOU'RE FIRED.", "sentence_index": 2, "ann": 0}, {"sentence": "Find something else to do!\"", "sentence_index": 3, "ann": 0}, {"sentence": "The salvo comes after the NFL and its players' union on Saturday slammed Trump for suggesting that owners fire players who kneel during the national anthem and that fans consider walking out in protest \"when somebody disrespects our flag.\"", "sentence_index": 4, "ann": 0}, {"sentence": "\"Divisive comments like these demonstrate an unfortunate lack of respect for the NFL, our great game and all of our players,\" the league commissioner, Roger Goodell, said in a statement.", "sentence_index": 5, "ann": 1}, {"sentence": "DeMaurice Smith, executive director of the NFL Players Association, tweeted: \"We will never back down.", "sentence_index": 6, "ann": 0}, {"sentence": "We no longer can afford to stick to sports.\"", "sentence_index": 7, "ann": 0}, {"sentence": "Trump on Friday said at a Alabama rally that he's hoping team owners take a hard line stance against players who take a knee during \"The Star-Spangled Banner.\"", "sentence_index": 8, "ann": 0}]}