{"event": "NorthKora", "date_event": "2017-12-13", "id_article": 37, "num_sents": 20, "source": "006_BBC News_1", "source_bias": "left-center", "url": "http://www.bbc.com/news/world-us-canada-42333262", "ref": "001_Reuters_1", "ref_url": "https://www.reuters.com/article/us-northkorea-missiles-tillerson/tillerson-says-u-s-ready-to-talk-to-north-korea-japan-wants-pressure-idUSKBN1E62UI", "ref_title": "Tillerson says U.S. ready to talk to North Korea; Japan wants pressure", "ref_text": "<p>WASHINGTON/SEOUL (Reuters) - U.S. Secretary of State Rex Tillerson offered to begin direct talks with North Korea without pre-conditions, backing away from a key U.S. demand that Pyongyang must first accept that giving up its nuclear arsenal would be p", "title": "Trumplomacy: Tillerson's 2018 hopes for North Korea", "ann_article": 0, "ann_title": 0, "body": [{"sentence": "The reticent Secretary of State spoke at great length on Tuesday, first in a town hall meeting with State Department staff, and then in a policy speech at the Atlantic Council.", "sentence_index": 0, "ann": 0}, {"sentence": "The headlines are that he's trying to find a way just to get in the same room, around the same table, as the North Koreans, that he's announced the first steps of his controversial department redesign - \"quick wins\" he called them - and that he plans", "sentence_index": 1, "ann": 0}, {"sentence": "Oh, and he's more comfortable with cowboy culture than Washington politicos.", "sentence_index": 2, "ann": 0}, {"sentence": "The North Korea line came up in a question-and-answer session after two scripted speeches on the same topic, and the White House was quick to say it wasn't a policy shift.", "sentence_index": 3, "ann": 0}, {"sentence": "But it sounded like a softening.", "sentence_index": 4, "ann": 0}, {"sentence": "Tillerson said Washington was ready to talk without preconditions, whenever Pyongyang was ready, and that first chat could be about anything, even the weather.", "sentence_index": 5, "ann": 0}, {"sentence": "In the past he's been vague about preconditions, but suggested the North Koreans would have to at least demonstrate a willingness to consider giving up their nuclear arsenal.", "sentence_index": 6, "ann": 0}, {"sentence": "So his readiness for talks of any kind, at least initially, is interesting.", "sentence_index": 7, "ann": 0}, {"sentence": "And this coincides with a very senior UN visit to Pyongyang, by the Undersecretary General Jeffrey Feltman.", "sentence_index": 8, "ann": 0}, {"sentence": "He urged North Korean officials to consider \"talks about talks\", in what he described as the most important mission he has ever taken.", "sentence_index": 9, "ann": 0}, {"sentence": "President Trump has taken a much tougher line in his public statements - famously tweeting that Tillerson was wasting his time trying to negotiate with \"Little Rocket Man,\" his derogatory nickname for Kim Jong Un.", "sentence_index": 10, "ann": 1}, {"sentence": "But in practice he's gone along with Tillerson's diplomatic strategy, for now.", "sentence_index": 11, "ann": 0}, {"sentence": "And the secretary of state remained clear about the goal: that the US ultimately could not accept a nuclear-armed North Korea.", "sentence_index": 12, "ann": 0}, {"sentence": "Kim Jong Un, meanwhile, has been saying that his country aims to be the \"strongest nuclear power\" in the world.", "sentence_index": 13, "ann": 0}, {"sentence": "So no imminent visits to North Korea for Tillerson, but he will be travelling to South America and Africa in the new year, which suggests he plans to stay on for a bit longer as the country's top diplomat, despite reports that Trump doesn't get alon", "sentence_index": 14, "ann": 0}, {"sentence": "Tillerson gave a nod to his difficult year when asked by a State Department employee whether he was enjoying his job.", "sentence_index": 15, "ann": 0}, {"sentence": "\"I'm learning to enjoy it,\" he said, to laughter from the floor.", "sentence_index": 16, "ann": 0}, {"sentence": "He explained that he didn't enjoy the actual task of dealing with countries like North Korea and Pakistan, but he did enjoy working with the department's diplomats and experts on these topics.", "sentence_index": 17, "ann": 0}, {"sentence": "His town hall was an effort to connect with staff who've have been alienated by the perception that he's gutting the State Department amidst budget cuts and hiring freezes.", "sentence_index": 18, "ann": 0}, {"sentence": "Tillerson gave them their first briefing on his project to redesign the department: he presented plans to revamp its outdated information technology; streamline its functions; and improve career management.", "sentence_index": 19, "ann": 0}]}