{"event": "Johnson", "date_event": "2017-12-15", "id_article": 4, "num_sents": 20, "source": "015_Fox News_1", "source_bias": "right", "url": "http://www.foxnews.com/politics/2017/12/14/widow-kentucky-state-rep-dan-johnson-says-shell-pursue-his-seat.html", "ref": "Reuters", "ref_url": "https://www.reuters.com/article/us-kentucky-johnson/kentucky-lawmaker-a-probable-suicide-amid-sexual-misconduct-accusations-idUSKBN1E809N", "ref_title": "Kentucky lawmaker a 'probable suicide' amid sexual misconduct accusations", "ref_text": "<p>(Reuters) - Kentucky state Representative Dan Johnson, who was facing sexual assault accusations, died in a probable suicide on Wednesday, Bullitt County Coroner Dave Billings said.</p>\r\n<p>Johnson, 57, also the leader of the Louisville-area Heart of Fi", "title": "Widow of Kentucky State Rep. Dan Johnson says she'll pursue his seat", "ann_article": 1, "ann_title": 1, "body": [{"sentence": "The wife of Kentucky State Rep. Dan Johnson, who killed himself on Wednesday amid a bombshell report's accusations of sexual assault, announced Thursday that she would pursue her husband's seat, saying \"his fight will go on.\"", "sentence_index": 0, "ann": 1}, {"sentence": "Dan Johnson, a preacher and a Republican, committed suicide Wednesday on a bridge in Mt.", "sentence_index": 1, "ann": 1}, {"sentence": "Washington, according to Bullitt County Sheriff Donnie Tinnell.", "sentence_index": 2, "ann": 0}, {"sentence": "The coroner confirmed that Johnson died of a single gunshot wound to the head, and the weapon was found near the 57-year-old's body.", "sentence_index": 3, "ann": 1}, {"sentence": "The statement from Johnson's widow, Rebecca, said she was running for the position because \"these high-tech lynchings based on lies and half-truths can't be allowed to win the day.\"", "sentence_index": 4, "ann": 1}, {"sentence": "\"Dan is gone but the story of his life is far from over,\" she said.", "sentence_index": 5, "ann": 1}, {"sentence": "His death occurred just days after the Kentucky Center for Investigative Reporting published a detailed set of allegations from a woman who claimed that Johnson sexually assaulted her when she was 17.", "sentence_index": 6, "ann": 1}, {"sentence": "The lawmaker denied the accusations on Tuesday, calling them \"totally false.\"", "sentence_index": 7, "ann": 1}, {"sentence": "He said they were part of a nationwide strategy for defeating conservative Republicans, referencing claims also made against Republican Alabama Senate candidate Roy Moore.", "sentence_index": 8, "ann": 0}, {"sentence": "But the next day, Johnson posted an ominous message on his Facebook page, part of which prompted his family to report him missing, the sheriff said Thursday.", "sentence_index": 9, "ann": 1}, {"sentence": "In the post, he asked for people to take care of his wife and wrote that post-traumatic stress disorder \"is a sickness that will take my life, I cannot handle it any longer.", "sentence_index": 10, "ann": 1}, {"sentence": "It has won this life, BUT HEAVEN IS MY HOME.\"", "sentence_index": 11, "ann": 1}, {"sentence": "The post appears to have been removed.", "sentence_index": 12, "ann": 1}, {"sentence": "The woman who made the accusations against Dan Johnson, Maranda Richmond, said she attended a New Year's Eve party at his house in 2012.", "sentence_index": 13, "ann": 1}, {"sentence": "She reportedly fell asleep on the couch, and in the early hours of Jan. 1, 2013, claimed she woke up to him kneeling over her and alleged he assaulted her.", "sentence_index": 14, "ann": 1}, {"sentence": "Richmond said that she reported the episode but Louisville police closed the case without charges.", "sentence_index": 15, "ann": 1}, {"sentence": "The case has since been reopened.", "sentence_index": 16, "ann": 1}, {"sentence": "Johnson was elected to the State Legislature in 2016, part of a wave of Republican victories that gave the GOP control of the Kentucky House of Representatives for the first time in nearly 100 years.", "sentence_index": 17, "ann": 1}, {"sentence": "The pastor of Heart of Fire church in Louisville, Johnson sponsored a number of bills involving religious liberty and teaching the Bible in public schools.", "sentence_index": 18, "ann": 0}, {"sentence": "But he was mostly out of the spotlight until the investigative story broke.", "sentence_index": 19, "ann": 0}]}