{"event": "NorthKora", "date_event": "2017-12-13", "id_article": 41, "num_sents": 20, "source": "021_Washington Examiner_2", "source_bias": "right", "url": "http://www.washingtonexaminer.com/rex-tillerson-us-open-to-initial-meeting-with-north-korea-without-precondition/article/2643293", "ref": "001_Reuters_1", "ref_url": "https://www.reuters.com/article/us-northkorea-missiles-tillerson/tillerson-says-u-s-ready-to-talk-to-north-korea-japan-wants-pressure-idUSKBN1E62UI", "ref_title": "Tillerson says U.S. ready to talk to North Korea; Japan wants pressure", "ref_text": "<p>WASHINGTON/SEOUL (Reuters) - U.S. Secretary of State Rex Tillerson offered to begin direct talks with North Korea without pre-conditions, backing away from a key U.S. demand that Pyongyang must first accept that giving up its nuclear arsenal would be p", "title": "US open to initial meeting with North Korea 'without precondition'", "ann_article": 1, "ann_title": 1, "body": [{"sentence": "Secretary of State Rex Tillerson is willing to talk to North Korean officials \"without precondition,\" at least for an initial round of diplomacy over the regime's nuclear weapons program.", "sentence_index": 0, "ann": 1}, {"sentence": "\"[W]e're ready to have the first meeting without precondition,\" Tillerson said during an event at the Atlantic Council in Washington, D.C. \"Let's just meet.", "sentence_index": 1, "ann": 1}, {"sentence": "We can talk about the weather if you want.", "sentence_index": 2, "ann": 0}, {"sentence": "We can talk about whether it's going to be a square table or a round table if that's what you're excited about.", "sentence_index": 3, "ann": 0}, {"sentence": "But can we at least sit down and see each other face-to-face.", "sentence_index": 4, "ann": 0}, {"sentence": "And then we can begin to lay out a map, a roadmap, of what we might be willing to work towards.\"", "sentence_index": 5, "ann": 0}, {"sentence": "That's a less-demanding posture that Tillerson has adopted in recent months when he ruled out negotiations based on anything other than North Korea agreeing to dismantle its nuclear weapons program.", "sentence_index": 6, "ann": 0}, {"sentence": "Tillerson maintained a hardline position regarding the regime's long-term retention of the nuclear weapons, but he seemed to soften his previous expectations for what early negotiations might look like.", "sentence_index": 7, "ann": 1}, {"sentence": "\"It's not realistic to say 'we're only going to talk if you come to the table ready to give up your program.'", "sentence_index": 8, "ann": 0}, {"sentence": "They have too much invested in it,\" Tillerson said.", "sentence_index": 9, "ann": 0}, {"sentence": "\"And the president is very realistic about that as well.\"", "sentence_index": 10, "ann": 0}, {"sentence": "That perspective appears to represent a shift in Tillerson's thinking.", "sentence_index": 11, "ann": 1}, {"sentence": "\"We don't think having a dialogue where the North Koreans come to the table assuming they're going to maintain their nuclear weapons is productive,\" he told reporters in August.", "sentence_index": 12, "ann": 0}, {"sentence": "Tillerson's negotiating posture might harden after the United States sharpened its assessment of \"a new leader in North Korea that no one has ever engaged with.\"", "sentence_index": 13, "ann": 0}, {"sentence": "He emphasized that the United States cannot learn to live with a nuclear-armed North Korea, notwithstanding the history of doing so with the Soviet empire during the Cold War.", "sentence_index": 14, "ann": 0}, {"sentence": "\"The difference is that, [from] the past behavior of North Korea, it's clear to us that they would not just use the possess of nuclear weapons as a deterrent,\" Tilllerson said.", "sentence_index": 15, "ann": 0}, {"sentence": "\"This would become a commercial activity for them, because we already see elements of it in the commercial marketplace.", "sentence_index": 16, "ann": 1}, {"sentence": "And in a world we live in today where our greatest threats are non-state actors, we simply cannot accept that.\"", "sentence_index": 17, "ann": 0}, {"sentence": "That's why President Trump's team is willing to contemplate the possibility of war with North Korea despite the recognition that such a conflict \"would be catastrophic,\" as Defense Secretary Jim Mattis has acknowledged.", "sentence_index": 18, "ann": 0}, {"sentence": "\"Yes, there are multiple military options that have been developed to deal with a failure on my part,\" Tillerson said.", "sentence_index": 19, "ann": 1}]}