{"event": "NorthKora", "date_event": "2017-12-13", "id_article": 44, "num_sents": 18, "source": "028_Newsweek_1", "source_bias": "left", "url": "http://www.newsweek.com/us-talk-north-korea-until-first-bomb-drops-rex-tillerson-says-746209", "ref": "001_Reuters_1", "ref_url": "https://www.reuters.com/article/us-northkorea-missiles-tillerson/tillerson-says-u-s-ready-to-talk-to-north-korea-japan-wants-pressure-idUSKBN1E62UI", "ref_title": "Tillerson says U.S. ready to talk to North Korea; Japan wants pressure", "ref_text": "<p>WASHINGTON/SEOUL (Reuters) - U.S. Secretary of State Rex Tillerson offered to begin direct talks with North Korea without pre-conditions, backing away from a key U.S. demand that Pyongyang must first accept that giving up its nuclear arsenal would be p", "title": "U.S. Will Talk To North Korea 'Until The First Bomb Drops,' Rex Tillerson Says", "ann_article": 1, "ann_title": 1, "body": [{"sentence": "Secretary of State Rex Tillerson told world leaders on Tuesday that the U.S. will seek diplomacy with North Korea \"until the first bomb drops.\"", "sentence_index": 0, "ann": 1}, {"sentence": "Tillerson reiterated his long-held stance in speaking before the Atlantic Council Korea Foundation Forum, but also said that Defense Secretary James Mattis is prepared for war if it comes to it.", "sentence_index": 1, "ann": 1}, {"sentence": "\"As I've told people many times, I will continue our diplomatic efforts until the first bomb drops,\" Tillerson said, according to The Hill.", "sentence_index": 2, "ann": 1}, {"sentence": "\"I'm confident that we're going to be successful, but I'm also confident that Secretary Mattis will be successful if it ends up being his turn.\"", "sentence_index": 3, "ann": 0}, {"sentence": "Keep up with this story and more by subscribing now", "sentence_index": 4, "ann": 0}, {"sentence": "Tillerson said the U.S. needs North Korea to come to the table for a conversation.", "sentence_index": 5, "ann": 0}, {"sentence": "\"We're ready to talk any time they'd like to talk,\" he said.", "sentence_index": 6, "ann": 0}, {"sentence": "\"In the meantime, our military preparedness is strong.\"", "sentence_index": 7, "ann": 0}, {"sentence": "The secretary of state explained that President Donald Trump has ordered military planners to have a \"full range of contingencies available\" and that they are ready for action.", "sentence_index": 8, "ann": 0}, {"sentence": "Tillerson's speech came as the U.S., South Korea and Japan wrapped up the second day of missile-tracking drills in the waters between the Korean Peninsula and Japan.", "sentence_index": 9, "ann": 0}, {"sentence": "They were the first trilateral anti-missile exercises the allies have conducted since North Korea launched its most powerful rocket yet on November 29, which it reported was capable of reaching anywhere in the U.S. mainland.", "sentence_index": 10, "ann": 1}, {"sentence": "The missile, called Hwasong-15, \"went higher, frankly, than any previous shot they've taken,\" Mattis said after the test.", "sentence_index": 11, "ann": 0}, {"sentence": "\"The bottom line is it is a continued effort to build a ballistic missile threat that endangers world peace, regional peace and certainly the United States.\"", "sentence_index": 12, "ann": 0}, {"sentence": "Last week, the U.S. and South Korea ran a large-scale joint aerial exercise called Vigilant Ace that involved more than 230 aircraft preparing for a military attack on the North.", "sentence_index": 13, "ann": 0}, {"sentence": "The show of power heightened tensions in the region, with Pyongyang blaming Trump for causing \"a flare-up.\"", "sentence_index": 14, "ann": 0}, {"sentence": "North Korea's Committee for the Peaceful Reunification of the Country called Trump \"insane\" and stated that the aerial drills would \"push the already acute situation on the Korean Peninsula to the brink of nuclear war.\"", "sentence_index": 15, "ann": 1}, {"sentence": "North Korea leader Kim Jong Un has repeatedly said that he has no intention to denuclearize as the U.S. has demanded, and will continue building up the nation's nuclear and missile arsenal.", "sentence_index": 16, "ann": 1}, {"sentence": "After Trump in September threatened to \"totally destroy\" the regime if provoked, Kim responded, \"The path I chose is correct and that is the one I have to follow to the last.\"", "sentence_index": 17, "ann": 0}]}