{"event": "Johnson", "date_event": "2017-12-15", "id_article": 5, "num_sents": 20, "source": "018_Rare", "source_bias": "right-center", "url": "http://rare.us/rare-news/after-her-husbands-high-tech-lynching-the-widow-of-a-state-rep-accused-of-molestation-plans-to-fight/", "ref": "Reuters", "ref_url": "https://www.reuters.com/article/us-kentucky-johnson/kentucky-lawmaker-a-probable-suicide-amid-sexual-misconduct-accusations-idUSKBN1E809N", "ref_title": "Kentucky lawmaker a 'probable suicide' amid sexual misconduct accusations", "ref_text": "<p>(Reuters) - Kentucky state Representative Dan Johnson, who was facing sexual assault accusations, died in a probable suicide on Wednesday, Bullitt County Coroner Dave Billings said.</p>\r\n<p>Johnson, 57, also the leader of the Louisville-area Heart of Fi", "title": "Widow of Kentucky state rep Dan Johnson plans to run for his seat", "ann_article": 1, "ann_title": 0, "body": [{"sentence": "\"Dan is gone,\" says Rebecca Johnson, wife of deceased Kentucky state rep Dan Johnson, \"but the story of his life is far from over.\"", "sentence_index": 0, "ann": 0}, {"sentence": "Rep. Dan Johnson took his life on a bridge in Mt.", "sentence_index": 1, "ann": 1}, {"sentence": "Washington, Kentucky on Wednesday.", "sentence_index": 2, "ann": 0}, {"sentence": "Now, according to WRAL, his widow plans to run for the office he vacated with a handgun.", "sentence_index": 3, "ann": 1}, {"sentence": "RELATED: An investigation into a state lawmaker accused of child molestation has ended with a single gunshot", "sentence_index": 4, "ann": 1}, {"sentence": "Johnson stood accused of molestation of a 17-year-old girl in an apartment underneath the Heart of Fire City Church's Fellowship Hall on New Year's Eve 2012.", "sentence_index": 5, "ann": 0}, {"sentence": "An investigation by the Kentucky Center for Investigative Reporting found that a case to the allegations was closed.", "sentence_index": 6, "ann": 0}, {"sentence": "Following their report and an on-the-record interview with alleged victim Maranda Richmond, who is now 21, police reopened the case.", "sentence_index": 7, "ann": 0}, {"sentence": "No charges were filed before Johnson took his life.", "sentence_index": 8, "ann": 0}, {"sentence": "\"These high-tech lynchings based on lies and half-truths can't be allowed to win the day,\" said Rebecca Johnson, who stood by her husband's side as he dismissed the molestation allegations in a press conference on Tuesday.", "sentence_index": 9, "ann": 0}, {"sentence": "That press conference saw Rep. Johnson say he was \"mad as can be\" about the charges, which he said were made into \"political stones and political rocks.\"", "sentence_index": 10, "ann": 1}, {"sentence": "He said the allegations against him were \"something that's totally false.\"", "sentence_index": 11, "ann": 0}, {"sentence": "Rebecca Johnson says she has stood by her husband's side for 30 years and plans to continue his \"fight.\"", "sentence_index": 12, "ann": 0}, {"sentence": "In expressing their condolences, Louisville Public Media, which oversees the Kentucky Center for Investigative Reporting, says they contacted Johnson several times in the course of writing their story, which called Johnson's life a \"long con\" and a ", "sentence_index": 13, "ann": 1}, {"sentence": "They say they did not receive a response, but added:", "sentence_index": 14, "ann": 1}, {"sentence": "All of us at Louisville Public Media are deeply sad to hear that State Representative Dan Johnson has died, apparently of suicide.", "sentence_index": 15, "ann": 0}, {"sentence": "We grieve for his family, friends, church community and constituents.", "sentence_index": 16, "ann": 0}, {"sentence": "Our Kentucky Center for Investigative Reporting released a report on Johnson this week.", "sentence_index": 17, "ann": 0}, {"sentence": "Our aim, as always, is to provide the public with fact-based, un3 reporting and hold public officials accountable for their actions.", "sentence_index": 18, "ann": 0}, {"sentence": "As part of our process, we reached out to Representative Johnson numerous times over the course of a seven-month investigation.", "sentence_index": 19, "ann": 0}]}