{"event": "Johnson", "date_event": "2017-12-15", "id_article": 8, "num_sents": 18, "source": "026_Townhall_1", "source_bias": "right", "url": "https://townhall.com/tipsheet/leahbarkoukis/2017/12/14/kentucky-lawmaker-kills-self-sexual-assault-n2422471", "ref": "Reuters", "ref_url": "https://www.reuters.com/article/us-kentucky-johnson/kentucky-lawmaker-a-probable-suicide-amid-sexual-misconduct-accusations-idUSKBN1E809N", "ref_title": "Kentucky lawmaker a 'probable suicide' amid sexual misconduct accusations", "ref_text": "<p>(Reuters) - Kentucky state Representative Dan Johnson, who was facing sexual assault accusations, died in a probable suicide on Wednesday, Bullitt County Coroner Dave Billings said.</p>\r\n<p>Johnson, 57, also the leader of the Louisville-area Heart of Fi", "title": "Kentucky Lawmaker Kills Self After Sexual Assault Allegations Made Public", "ann_article": 0, "ann_title": 0, "body": [{"sentence": "A Kentucky state representative committed suicide Wednesday, two days after allegations he sexually assaulted a teenage girl were made public.", "sentence_index": 0, "ann": 0}, {"sentence": "According to Sheriff Donnie Tinnell of Bullitt County, Republican Rep. Dan Johnson killed himself on a bridge in Mount Washington, Kentucky.", "sentence_index": 1, "ann": 0}, {"sentence": "The coroner said he \"died of a single gunshot wound\" and determined it was \"a probable suicide.\"", "sentence_index": 2, "ann": 1}, {"sentence": "Police were alerted after Johnson posted a suicide note on Facebook.", "sentence_index": 3, "ann": 0}, {"sentence": "Officers pinged his cell phone and found his body next to his car.", "sentence_index": 4, "ann": 0}, {"sentence": "The lawmaker's death comes after the Kentucky Center for Investigative reporting published an expose Monday detailing an allegation that Johnson had sexually assaulted a 17-year-old parishioner from the church where he was bishop.", "sentence_index": 5, "ann": 1}, {"sentence": "The alleged incident occurred after a New Year's Eve party in 2012.", "sentence_index": 6, "ann": 0}, {"sentence": "The parishioner, now 21, said that in the early hours of Jan. 1, 2013, after a New Year's Eve party at the church, she and Mr. Johnson's daughter slept over at an apartment below the fellowship hall.", "sentence_index": 7, "ann": 0}, {"sentence": "After falling asleep on a sofa, she said, she woke up to find Mr. Johnson - who was drunk after going to a bar earlier in the night - kneeling over her.", "sentence_index": 8, "ann": 0}, {"sentence": "He proceeded to kiss her, grope her breasts under her shirt, put his hand down her pants and penetrate her with his finger, she said.", "sentence_index": 9, "ann": 1}, {"sentence": "The woman reported the assault to the Louisville Metro Police Department within months of the episode, but no charges were filed.", "sentence_index": 10, "ann": 0}, {"sentence": "However, her account was corroborated by family members, by her therapist's notes from the first half of 2013 and by Facebook messages she exchanged with Mr. Johnson, the Kentucky Center for Investigative Reporting wrote.", "sentence_index": 11, "ann": 0}, {"sentence": "(New York Times)", "sentence_index": 12, "ann": 0}, {"sentence": "Johnson denied the allegations earlier this week, saying at a press conference: \"This allegation concerning this lady, this young girl, absolutely has no merit, these are unfounded accusations, totally.\"", "sentence_index": 13, "ann": 0}, {"sentence": "He went on to argue the allegation against him was, in part, politically motivated-that the woman was a supporter of Hillary Clinton who opposed his conservative beliefs.", "sentence_index": 14, "ann": 0}, {"sentence": "\"This is an assault on all real people, there's no perfect people and you get into office and all of sudden political hacks come against you and start accusing you after you're in office,\" Johnson said.", "sentence_index": 15, "ann": 0}, {"sentence": "Mac Brown, chairman of the Republican Party of Kentucky, called on him to resign after the investigative report, which he called \"extensively sourced.\"", "sentence_index": 16, "ann": 0}, {"sentence": "\"[O]nce again find ourselves in a position where we must call for him to resign, this time, from the Kentucky General Assembly,\" Brown said in a statement.", "sentence_index": 17, "ann": 0}]}