{"event": "Johnson", "date_event": "2017-12-15", "id_article": 9, "num_sents": 20, "source": "028_The Sun_1", "source_bias": "right", "url": "https://www.thesun.co.uk/news/worldnews/5136376/op-us-politician-dan-johnson-kills-himself-after-being-accused-of-raping-his-daughters-17-year-old-pal-url-dan-johnson-dead-kentucky-accused-raping-daughter-friend/", "ref": "Reuters", "ref_url": "https://www.reuters.com/article/us-kentucky-johnson/kentucky-lawmaker-a-probable-suicide-amid-sexual-misconduct-accusations-idUSKBN1E809N", "ref_title": "Kentucky lawmaker a 'probable suicide' amid sexual misconduct accusations", "ref_text": "<p>(Reuters) - Kentucky state Representative Dan Johnson, who was facing sexual assault accusations, died in a probable suicide on Wednesday, Bullitt County Coroner Dave Billings said.</p>\r\n<p>Johnson, 57, also the leader of the Louisville-area Heart of Fi", "title": "Top US politician Dan Johnson kills himself following Facebook post slamming 'judge and jury fake news' after being accused of raping his daughter's 17-year-old pal", "ann_article": 1, "ann_title": 0, "body": [{"sentence": "A TOP politician killed himself after leaving a Facebook post slamming accusations that he raped his daughter's teenage friend.", "sentence_index": 0, "ann": 1}, {"sentence": "Kentucky state representative Dan Johnson died of a single gunshot wound after stopping his car in a secluded part of Mount Washington, the coroner said.", "sentence_index": 1, "ann": 0}, {"sentence": "Johnson, also the leader of the Heart of Fire Church, denied the accusations reported by the Kentucky Center for Investigative Reporting.", "sentence_index": 2, "ann": 0}, {"sentence": "The story accused Johnson, a Republican who was a firm supporter of President Donald Trump, of having molested a member of his church.", "sentence_index": 3, "ann": 1}, {"sentence": "The woman said she was aged 17 at the time of the alleged incident in the church basement.", "sentence_index": 4, "ann": 0}, {"sentence": "She claimed Johnson crept into the room while she was sleeping beside his daughter and groped and penetrated her against her will.", "sentence_index": 5, "ann": 1}, {"sentence": "Police had been searching for Johnson after someone read a post on his Facebook page and became concerned.", "sentence_index": 6, "ann": 0}, {"sentence": "In the post, written on Wednesday, Johnson paid tribute to his family, saying he had suffered post-traumatic stress disorder for 16 years - \"a sickness that will take my life\".", "sentence_index": 7, "ann": 1}, {"sentence": "He wrote: \"The accusations from NPR are false GOD and only GOD knows the truth, nothing is the way they make it out to be.", "sentence_index": 8, "ann": 0}, {"sentence": "AMERICA will not survive this type of judge and jury fake news.\"", "sentence_index": 9, "ann": 0}, {"sentence": "At a press conference on Tuesday, Johnson linked the accusations to similar allegations against the Alabama Republican Roy Moore, who was defeated in a special Senate election that day, saying they were part of a nationwide strategy to defeat conser", "sentence_index": 10, "ann": 0}, {"sentence": "Michael Skoler, president of Louisville Public Media, which owns the Kentucky Center for Investigative Reporting, told the Washington Post everyone at the organisation is \"deeply sad.\"", "sentence_index": 11, "ann": 0}, {"sentence": "Skoler added: \"Our aim, as always, is to provide the public with fact-based, un3 reporting and hold public officials accountable for their actions.", "sentence_index": 12, "ann": 0}, {"sentence": "\"As part of our process, we reached out to Representative Johnson numerous times over the course of a seven-month investigation.", "sentence_index": 13, "ann": 0}, {"sentence": "\"He declined requests to talk about our findings.\"", "sentence_index": 14, "ann": 0}, {"sentence": "Kentucky Republican Gov.", "sentence_index": 15, "ann": 0}, {"sentence": "Matt Bevin wrote on Twitter: \"Saddened to hear of tonight's death of KY Representative Dan Johnson.", "sentence_index": 16, "ann": 0}, {"sentence": "\"My heart breaks for his family tonight ...", "sentence_index": 17, "ann": 0}, {"sentence": "These are heavy days in Frankfort and in America ... May God indeed shed His grace on us all ... We sure need it...\"", "sentence_index": 18, "ann": 0}, {"sentence": "We pay for your stories!", "sentence_index": 19, "ann": 0}]}